"""
赋值运算符: =
复合赋值运算符: +=, -=, *=, /=, //=, %=, **=
优先级: () > 算术运算符 > 赋值运算符(复合赋值运算符)
"""

# 赋值运算符
# 需要同时给多个变量赋值不同的值
# d = 30
# e = 40
# f = 50

d,e,f = 30,40,50
print(d,e,f)

# 同时给多个变量赋值同一个值
# d = 30
# e = 30
# f = 30
d = e = f = 30
print(d, e, f)

# 复合赋值运算符(相当于先计算算术值然后赋值给符号前面的变量)
a = 10
b = 3
c = 1

a += b  # a = a + b
print(a)  # 13
a -= c
print(a)  # 12
a *= a
print(a)  # 144
a /= b
print(a)  # 48.0
a //= b
print(a)  # 16.0
a %= b
print(a)  # 1.0
a **= b
print(a)  # 1.0

a &= b # a = a & b
print(a)
